
** pyenv
#+BEGIN_SRC emacs-lisp :results silent
  (use-package pyvenv
    :ensure t)
  (setq python-shell-virtualenv-root "/home/alkhaldieid/anaconda3/")
  (setq conda-env-home-directory "/home/alkhaldieid/anaconda3/")
  (setq conda-anaconda-home "/home/alkhaldieid/anaconda3/")
  ;; workon home
  (setenv "WORKON_HOME" "/home/alkhaldieid/anaconda3/envs/")
  ;; (setq python-shell-interpreter "ipython")
  ;;   python-shell-interpreter-args "--simple-prompt -i")

  ;; ;; 
  ;; (setq python-shell-interpreter "python3")
  ;; (setq python-shell-interpreter "python")
  ;; This works only with torch
  ;; (setq python-shell-interpreter "jupyter"
  ;;     python-shell-interpreter-args "console --simple-prompt"
  ;;     python-shell-prompt-detect-failure-warning nil)
  (add-to-list 'python-shell-completion-native-disabled-interpreters
	     "jupyter")


  ;; clear the python inferior output buffer
  (defun my-clear ()
    (interactive)
    (let ((comint-buffer-maximum-size 0))
      (comint-truncate-buffer)))
  (add-hook 'python-mode-hook
	    (lambda ()
	      (define-key evil-normal-state-local-map
			  (kbd "o") 'evil-org-open-below)
			  (kbd "O") 'evil-org-open-above))
#+END_SRC

#+RESULTS:
| (lambda nil (define-key evil-normal-state-local-map (kbd o) 'evil-org-open-below) (kbd O) 'evil-org-open-above) | yasnippet-snippets--fixed-indent | my/python-mode-hook | jedi:setup |
** eglot
 #+BEGIN_SRC emacs-lisp :tangle nil
   (use-package eglot
     :ensure t)
   ;;;  (add-hook 'foo-mode-hook 'eglot-ensure)
   (add-hook 'python-mode-hook 'eglot-ensure)
 #+END_SRC

 #+RESULTS:
 | eglot-ensure | my/python-mode-hook | jedi:setup | elpy-mode |

** make C-u C-c C-c behave like C-c C-c in python-mode
#+BEGIN_SRC emacs-lisp :tangle nil
;; Make C-c C-c behave like C-u C-c C-c in Python mode
(require 'python)
(define-key python-mode-map (kbd "C-c C-c")
  (lambda () (interactive) (python-shell-send-buffer t)))
#+END_SRC

#+RESULTS:
| lambda | nil | (interactive) | (python-shell-send-buffer t) |

